import React from 'react';
import UserList from './components/UserList/index.jsx';

function App() {
  return <UserList />;
}

export default App;

/* 
   TODO Створити список користувачів (компоненти UsersList, UserListItem). (Взаємодія parent -> child: props).
   !    Користувачі мають таку інформацію: id, firstName, lastName, age, imgSrc, ... .
   ?    Застилити картки користувачів (можна використати стилі для карток з минулого ДЗ або приклад у додатку або по-своєму).

  * Реалізувати (одне або обидва):
    - * вибір користувача (на кліку на нього). Вибраних користувачів стилити, наприклад, бордером та тлом;
    - * видалення користувача (на кліку на кнопці біля користувача).
    (Взаємодія child -> parent: callback).
  
  * При реалізації обох сценаріїв можливо потрібно буде вішати обробники на різні фази: на сплив (onClick) і занурення (onClickCapture) або використовувати e.preventDefault() в одному з обробників.
*/
